# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceArray..::..ReverseIterator Method
ReferenceArray Class See Also
---
Retrieve a backward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ReferenceArrayIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As ReferenceArrayIterator
```

Visual C++
---
```text
public:
virtual ReferenceArrayIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the array.
# See Also
ReferenceArray Class
Autodesk.Revit.DB Namespace